# Образ ноды и эмит дист сделать свежими, иначе легаси
FROM node:20
# Создание папки app
WORKDIR /app
# В докере надо сначала установить зависимости, чтобы они закешировались, потом исходный код
# То есть не придется переустанавливать node_modules каждый раз при сборке имаджа

# Копирование pkg.json и pkg-lock.json в корень
COPY package*-json ./
# Установка зависимостей
RUN npm install --omit=dev
# Копирование исходного кода
COPY ./dist .
# Настройка .env переменной в контейнере
ENV PORT = 8080

EXPOSE 8080

CMD ["node", "dist/main.js"]